import { A } from 'solid-start'

import { FixedTitle } from '~/components/head/title'
import { InformationContainer } from '~/components/information-container'

export default function Terms() {
  return (
    <>
      <>
        <FixedTitle>利用規約 | aivy</FixedTitle>
      </>
      <InformationContainer>
        <h1>利用規約</h1>

        <div>
          本利用規約（以下「本規約」といいます。）は、
          <A href="https://twitter.com/ddpn08" target="_blank">
            ddPn08
          </A>
          （以下「運営者」といいます。）が本ウェブサイト（関連するアプリケーションを作成した場合にはこれらのアプリケーションを含みます。）
          上で提供するサービス「aivy」（名称を変更する場合には名称変更後のサービスを含め、以下「本サービス」といいます。）の利用条件を定めるものです。
          <br />
          本サービスのユーザ（以下「利用者」といいます。）は、本規約に同意したうえで、本サービスをご利用いただきます。
        </div>

        <h2>第1条（規約の適用）</h2>
        <div>
          本規約は、本サービスの提供条件及び運営者と利用者との間の権利義務関係を定めることを目的とし、利用者と運営者との間のサービスの利用に関わる一切の関係に適用されるものとします。
        </div>

        <h2>第2条（利用資格）</h2>
        <div>
          <ol>
            <li>本サービスは以下の条件をすべて満たす方に限り、ご利用いただくことができます。</li>
            <ol>
              <li>
                ご自身でインターネットの利用環境、端末、ソフトウェアなどを用意することができる方
              </li>
              <li>
                本規約、及び
                <A href="guideline">ガイドライン</A>
                に同意かつ遵守できる方
              </li>
              <li>過去に本規約に違反したことのない方</li>
            </ol>
          </ol>
        </div>

        <h2>第3条（認証情報の管理）</h2>
        <div>
          <ol>
            <li>
              利用者は、本サービスのアカウント登録にあたって登録するログインID、パスワードその他の認証情報
              （以下「認証情報」といい、本サービスと連携する運営者以外の者が運営するサービスの認証情報を含みます。）を、
              自己の責任において適切に管理および保管するものとします。
              <br />
              利用者は、いかなる場合にも、認証情報の使用権限を第三者に譲渡または貸与することはできません。
            </li>
            <li>
              利用者が本サービスのアカウント登録にあたって認証情報として利用する、運営者以外の者が運営するサービス（以下「外部サービス」といいます。）
              の登録、利用については、当該外部サービスが規定する各規約の定めに従い利用者自身の責任で行うものとします。
            </li>
            <li>
              認証情報の管理不十分、第三者の使用等によって生じた損害または不利益に関する責任は利用者が負うものとし、運営者は一切の責任を負いません。
            </li>
          </ol>
        </div>

        <h2>第4条（禁止事項）</h2>
        <div>
          <ol>
            <li>
              利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。
              <ol>
                <li>法令または公序良俗に違反する行為</li>
                <li>犯罪行為に関連する行為</li>
                <li>運営者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
                <li>本サービスの運営を妨害する行為、または妨害するおそれのある行為</li>
                <li>他者の個人情報等を収集または蓄積する行為</li>
                <li>他者に成りすます行為</li>
                <li>反社会的勢力に対して直接的または間接的に利益を供与する行為</li>
                <li>
                  本サービスの利用者および運営者、第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為
                </li>
                <li>
                  何らかの手段により、本サービス上の有料コンテンツに支払いなくアクセスする行為
                </li>
                <li>他の利用者および第三者を欺く虚偽の内容を記載する行為</li>
                <li>
                  スパムとみなされる行為（機械により自動生成された文章の投稿や同一内容の文章を繰り返し投稿する行為など）
                </li>
                <li>
                  過度に暴力的な表現、露骨な性的表現、人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現、自殺、自傷行為、薬物乱用を誘引または助長する表現、他人に不快感を与える表現等、不適切な内容を投稿する行為
                </li>
                <li>
                  性行為やわいせつな行為を目的とする行為、面識のない異性との出会いや交際を目的とする行為、他者に対する嫌がらせや誹謗中傷
                </li>
                <li>宗教活動または宗教団体への勧誘行為</li>
                <li>その他、運営者が不適切と判断する行為</li>
              </ol>
            </li>
            <li>
              前項のいずれかの行為が発覚した場合、当該コンテンツの削除、あるいはその利用者のアカウントを停止・削除する場合があります。
            </li>
          </ol>
        </div>

        <h2>第5条（本サービスの提供の停止等）</h2>
        <div>
          <ol>
            <li>
              運営者は、以下のいずれかの事由があると判断した場合、利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
              <ol>
                <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
                <li>
                  地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
                </li>
                <li>コンピュータまたは通信回線等が事故により停止した場合</li>
                <li>本サービスが利用しているクラウドサービスが停止した場合</li>
                <li>その他、運営者が本サービスの提供が困難と判断した場合</li>
              </ol>
            </li>
            <li>
              運営者は、本サービスの提供の停止または中断により、利用者または第三者が被ったいかなる損害または不利益について、理由を問わず一切の責任を負わないものとします。
            </li>
          </ol>
        </div>

        <h2>第6条（著作権等）</h2>
        <div>
          <ol>
            <li>
              利用者は、自ら著作権等の必要な知的財産権を有するか、または権利者から必要な許諾を受けた文章、画像等の著作物のみ、本サービスを利用して投稿及び編集できるものとします。
            </li>
            <li>
              利用者が本サービスを利用して投稿または編集した文章、画像等のコンテンツ（以下「利用者コンテンツ」といいます。）につき生じる著作権については、当該利用者あるいはその権利者に留保されるものとします。
            </li>
            <li>
              利用者または第三者は、利用者コンテンツについて、権利者の許可を得ることなく、無断で転載または二次配布等を行うことはできません。
            </li>
            <li>
              利用者は、運営者が利用者コンテンツを本ウェブサイトに掲載し、これを配信（公衆送信及び送信可能化することを含みます。）することを許諾するものとします。ただし、運営者所定の手続きにより利用者が有料配信の設定をした利用者コンテンツ（以下「有料コンテンツ」といいます。）については、本規約に定める条件に従って取り扱われるものとします。
            </li>
            <li>
              本条により運営者に許諾された利用者コンテンツに関する権利、および有料コンテンツにつき運営者または他の利用者に許諾されたアクセス権その他の権利は、運営者と利用者の間の契約が終了後も引き続きその効力を保持するものとします。
            </li>
          </ol>
        </div>

        <h2>第7条（登録抹消）</h2>
        <div>
          <ol>
            <li>
              利用者は所定の方法に従い登録アカウントを削除することにより、いつでもアカウント登録を抹消することができます。
            </li>
            <li>
              運営者は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。
            </li>
            <ol>
              <li>本規約のいずれかの条項に違反した場合</li>
              <li>登録事項に虚偽の事実があることが判明した場合</li>
              <li>運営者からの連絡に対し，一定期間返答がない場合</li>
              <li>本サービスについて，最終の利用から一定期間利用がない場合</li>
              <li>その他，運営者が本サービスの利用を適当でないと判断した場合</li>
            </ol>
            <li>
              前項各号のいずれかに該当した場合，ユーザーは，当然に運営者に対する一切の債務について期限の利益を失い，その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。
            </li>
            <li>
              運営者は，本条に基づき運営者が行った行為によりユーザーに生じた損害について，一切の責任を負いません。
            </li>
          </ol>
        </div>

        <h2>第8条（保証の否認および免責事項）</h2>
        <div>
          <ol>
            <li>
              運営者は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
            </li>
            <li>
              運営者は，本サービスに起因してユーザーに生じたあらゆる損害について、運営者の故意又は重過失による場合を除き、一切の責任を負いません。
            </li>
            <li>
              運営者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
            </li>
          </ol>
        </div>

        <h2>第9条（サービス内容の変更・停止）</h2>
        <div>
          <ol>
            <li>
              運営者は、利用者に通知することなく、本サービスの内容の変更および一部機能の停止をすることができるものとし、これによって利用者に生じた損害または不利益について一切の責任を負いません。
            </li>
            <li>
              運営者は、本サービスの終了に伴い利用者に生じる損害または不利益について責任を負いません。
            </li>
          </ol>
        </div>

        <h2>第10条（利用規約の変更）</h2>
        <div>
          <ol>
            <li>
              運営者は、利用者に通知または本ウェブサイト上に告知することにより、本サービスの内容又はシステムを変更することができます。
              なお、その変更が利用者にとって大きな影響があると運営者が判断した場合、可能な限り事前に通知または告知しますが、
              本サービスの運営上早急に対応が必要であると運営者が判断した場合には、この限りではありません。
            </li>
            <li>
              運営者は以下の場合には、ユーザーの個別の同意を要せず、本規約を変更することができるものとします。
            </li>
            <ol>
              <li>本規約の変更がユーザーの一般の利益に適合するとき。</li>
              <li>
                本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
              </li>
            </ol>
            <li>
              運営者はユーザーに対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。
            </li>
            <li>
              運営者は、前三項に従った本サービスの内容もしくはシステムの変更、または本規約の変更により生じたいかなる損害等についても責任を負いません。
            </li>
          </ol>
        </div>

        <h2>第11条（個人情報の取扱い）</h2>
        <div>
          運営者は，本サービスの利用によって取得する個人情報については，運営者「プライバシーポリシー」に従い適切に取り扱うものとします。
        </div>

        <h2>第12条（通知または連絡）</h2>
        <div>
          利用者と運営者との間の通知または連絡は、運営者の定める方法によって行うものとします。
        </div>

        <h2>第13条（権利義務の譲渡および貸与の禁止）</h2>
        <div>
          利用者は、運営者の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡および貸与することはできません。
        </div>

        <h2>第14条（準拠法・裁判管轄）</h2>
        <div>
          <ol>
            <li>本規約の解釈にあたっては，日本法を準拠法とします。</li>
            <li>
              本サービスに関して紛争が生じた場合には，運営者の所在地を管轄する裁判所を専属的合意管轄とします。
            </li>
          </ol>
        </div>
      </InformationContainer>
    </>
  )
}
